; domain
(define (domain satellite)

(:requirements
    :typing
    :fluents
    :negative-preconditions
    :conditional-effects
    :equality
)

; ==========================================================
; TYPES
; ==========================================================

(:types
    object
    direction
)

; ==========================================================
; DIRECTIONS
; ==========================================================

(:constants
    n ne e se s sw w nw - direction
)

; ==========================================================
; PREDICATES
; ==========================================================

(:predicates

    ; orientamento satellite
    (pointing ?d - direction)

    ; evita oscillazioni
    (last-dir ?d - direction)

    ; visibilità oggetti
    (visible ?o - object ?d - direction)

    ; stato invio
    (taken ?o - object)
    (sent ?o - object)

    ; qualità oggetto (NON della foto)
    (quality-hd ?o - object)
    (quality-sd ?o - object)

    ; grafo direzioni
    (next-right ?from ?to - direction)
    (next-left ?from ?to - direction)
)

; ==========================================================
; FUNCTIONS
; ==========================================================

(:functions
    (energy)
    (memory-used)
    (memory-capacity)
    (photo-count)
    (rotation-cost)
)

; ==========================================================
; ROTATE RIGHT
; ==========================================================

(:action rotate-right
    :parameters (?from ?to - direction)

    :precondition (and
        (pointing ?from)
        (next-right ?from ?to)
        (>= (energy) 1)
        (not (last-dir ?to))
    )

    :effect (and
        (not (pointing ?from))
        (pointing ?to)

        (not (last-dir ?from))
        (last-dir ?to)

        (increase (rotation-cost) 2)
        (decrease (energy) 1)
    )
)

; ==========================================================
; ROTATE LEFT
; ==========================================================

(:action rotate-left
    :parameters (?from ?to - direction)

    :precondition (and
        (pointing ?from)
        (next-left ?from ?to)
        (>= (energy) 1)
        (not (last-dir ?to))
    )

    :effect (and
        (not (pointing ?from))
        (pointing ?to)

        (not (last-dir ?from))
        (last-dir ?to)

        (increase (rotation-cost) 2)
        (decrease (energy) 1)
    )
)

; ==========================================================
; TAKE PICTURE (UNICA)
; ==========================================================

(:action take-picture

    :parameters (?o - object ?d - direction)

    :precondition (and
        (pointing ?d)
        (visible ?o ?d)

        (not (taken ?o))
        (not (sent ?o))

        (>= (energy) 2)

        (< (photo-count) 2)

        (<= (+ (memory-used) 10) (memory-capacity))
    )

    :effect (and

        (taken ?o)
        (increase (photo-count) 1)
        (decrease (energy) 2)

        (when (quality-hd ?o)
            (increase (memory-used) 10)
        )

        (when (quality-sd ?o)
            (increase (memory-used) 3)
        )
    )
)

; ==========================================================
; SEND
; ==========================================================

(:action send
    :parameters (?o - object)

    :precondition (and
        (pointing n)
        (taken ?o)
        (not (sent ?o))
        (>= (energy) 2)
    )

    :effect (and
        (sent ?o)
        (not (taken ?o))

        (decrease (photo-count) 1)
        (decrease (energy) 2)

        (when (quality-hd ?o)
            (decrease (memory-used) 10)
        )

        (when (quality-sd ?o)
            (decrease (memory-used) 3)
        )
    )
)

)

; problem
(define (problem satellite-medium)
(:domain satellite)

(:objects
    star1 planet1 junk1 noise2 - object
)

(:init

    (pointing s)
    (last-dir s)

    (visible star1 e)
    (visible planet1 w)

    (quality-hd star1)
    (quality-sd planet1)

    (= (energy) 50)
    (= (memory-used) 0)
    (= (memory-capacity) 13)
    (= (photo-count) 0)
    (= (rotation-cost) 0)

    (next-right n ne)
    (next-right ne e)
    (next-right e se)
    (next-right se s)
    (next-right s sw)
    (next-right sw w)
    (next-right w nw)
    (next-right nw n)

    (next-left ne n)
    (next-left e ne)
    (next-left se e)
    (next-left s se)
    (next-left sw s)
    (next-left w sw)
    (next-left nw w)
    (next-left n nw)
)

(:goal
    (and
        (sent star1)
        (sent planet1)
    )
)

(:metric minimize (+ (energy) (rotation-cost)))
)

; plan
1. (rotate-right s sw)
   deleted: (pointing s) (last-dir s)
   added: (pointing sw) (last-dir sw)
   changed: (rotation-cost) from 0 to 2, (energy) from 50 to 49
   goals met: 0 of 2
2. (rotate-right sw w)
   deleted: (pointing sw) (last-dir sw)
   added: (pointing w) (last-dir w)
   changed: (rotation-cost) from 2 to 4, (energy) from 49 to 48
   goals met: 0 of 2
3. (take-picture planet1 w)
   added: (taken planet1)
   changed: (photo-count) from 0 to 1, (energy) from 48 to 46, (memory-used) from 0 to 3
   goals met: 0 of 2
4. (rotate-right w nw)
   deleted: (pointing w) (last-dir w)
   added: (pointing nw) (last-dir nw)
   changed: (rotation-cost) from 4 to 6, (energy) from 46 to 45
   goals met: 0 of 2
5. (rotate-right nw n)
   deleted: (pointing nw) (last-dir nw)
   added: (pointing n) (last-dir n)
   changed: (rotation-cost) from 6 to 8, (energy) from 45 to 44
   goals met: 0 of 2
6. (send planet1)
   deleted: (taken planet1)
   added: (sent planet1)
   changed: (photo-count) from 1 to 0, (energy) from 44 to 42, (memory-used) from 3 to 0
   goals met: 1 of 2
7. (rotate-right n ne)
   deleted: (pointing n) (last-dir n)
   added: (pointing ne) (last-dir ne)
   changed: (rotation-cost) from 8 to 10, (energy) from 42 to 41
   goals met: 1 of 2
8. (rotate-right ne e)
   deleted: (pointing ne) (last-dir ne)
   added: (pointing e) (last-dir e)
   changed: (rotation-cost) from 10 to 12, (energy) from 41 to 40
   goals met: 1 of 2
9. (take-picture star1 e)
   added: (taken star1)
   changed: (photo-count) from 0 to 1, (energy) from 40 to 38, (memory-used) from 0 to 10
   goals met: 1 of 2
10. (rotate-left e ne)
   deleted: (pointing e) (last-dir e)
   added: (pointing ne) (last-dir ne)
   changed: (rotation-cost) from 12 to 14, (energy) from 38 to 37
   goals met: 1 of 2
11. (rotate-left ne n)
   deleted: (pointing ne) (last-dir ne)
   added: (pointing n) (last-dir n)
   changed: (rotation-cost) from 14 to 16, (energy) from 37 to 36
   goals met: 1 of 2
12. (send star1)
   deleted: (taken star1)
   added: (sent star1)
   changed: (photo-count) from 1 to 0, (energy) from 36 to 34, (memory-used) from 10 to 0
   goals met: 2 of 2
